In [41]:
import pandas as pd
import json

In [42]:
data = json.load(open('abs_15.json'))

In [43]:
df = pd.DataFrame(data["data"]["allRegions"]["regions"])

In [44]:
df["BILABS"][0]

[{'year': 2015, 'BILAG2': 'BILABS11', 'GES': 'GESM', 'value': 155},
 {'year': 2015, 'BILAG2': 'BILABS11', 'GES': 'GESW', 'value': 131},
 {'year': 2015, 'BILAG2': 'BILABS12', 'GES': 'GESM', 'value': 440},
 {'year': 2015, 'BILAG2': 'BILABS12', 'GES': 'GESW', 'value': 305},
 {'year': 2015, 'BILAG2': 'BILABS13', 'GES': 'GESM', 'value': 1201},
 {'year': 2015, 'BILAG2': 'BILABS13', 'GES': 'GESW', 'value': 1058},
 {'year': 2015, 'BILAG2': 'BILABS12', 'GES': None, 'value': 745},
 {'year': 2015, 'BILAG2': 'BILABS13', 'GES': None, 'value': 2259},
 {'year': 2015, 'BILAG2': 'BILABS11', 'GES': None, 'value': 286}]

In [45]:
def convert(df):
    for _, row in df.iterrows():
        for line in row['BILABS']:
            line['id'] = row['id']
            line['name'] = row['name']
            yield line

In [52]:
ndf = pd.DataFrame(convert(df))
ndf.sample(10)

      BILAG2   GES     id                 name  value  year
10  BILABS11  GESM  05112             Duisburg    183  2015
47  BILABS13  GESM  05117  M端lheim an der Ruhr    295  2015
80  BILABS13  None  05122             Solingen    663  2015
13  BILABS11  GESW  05112             Duisburg    132  2015
20  BILABS11  GESW  05113                Essen    186  2015
27  BILABS11  GESW  05114              Krefeld     78  2015
61  BILABS12  None  05119           Oberhausen    386  2015
19  BILABS11  GESM  05113                Essen    223  2015
17  BILABS11  None  05112             Duisburg    315  2015
3   BILABS12  GESW  05111           D端sseldorf    305  2015